src/os/linux/liunx三剑客.org
#+hugo_base_dir: ~/projects/blog/lijwxg

* linux命令

** DONE linux三剑客                                             :linux:shell:
   CLOSED: [2019-06-07 Sat 22:48]
   :properties:
   :export_file_name: linux三剑客
   :end:
linux 下最常用和通用的文件, 字符串查询, 操作脚本命令.

#+hugo: more
*** grep 命令使用

grep（global search regular expression(RE) and print out the line，全面搜索正则表达式并把行打印出来）是一种强大的文本搜索工具，它能使用正则表达式搜索文本，并把匹配的行打印出来。

**** 从单个文件中搜索指定的字串

#+begin_src shell
grep "this" demo_file
#+end_src

**** 在多个文件中检索指定的字串

#+begin_src shell
grep "this" demo_*
#+end_src

**** 用 grep -i 进行大小写无关的搜索

#+begin_src shell
grep -i "the" demo_file
#+end_src

**** 使用用正则表达式

#+begin_src shell
grep -i "lines.*empty" demo_file
#+end_src

**** 用 grep -w 搜索整个词，而不是词中的部分字串

#+begin_src shell
grep -w "is" demo_file
#+end_src

**** 使用 grep -A, -B and -C 显示之前、之后、前后的几行

- 显示匹配行之后的 N 行

#+begin_src shell
grep -A 3 -i "example" demo_text
#+end_src

- 显示匹配行之前的 N 行

#+begin_src shell
grep -B 2 "single WORD" demo_text
#+end_src

- 显示匹配行前后的 N 行

#+begin_src shell
grep -C 2 "Example" demo_text
#+end_src

**** 通过 GREP_OPTIONS 高亮显示搜索的字串

#+begin_src shell
export GREP_OPTIONS='--color=auto' GREP_COLOR='100;8'

grep this demo_file
#+end_src

**** 用 grep -r 递归搜索全部的文件

#+begin_src shell
grep -r "ramesh" *
#+end_src

**** 使用 grep -v 进行不匹配

#+begin_src shell
grep -v "go" demo_text
#+end_src

**** 显示不匹配全部模式的行

#+begin_src shell
grep -v -e "a" -e "b" -e "c" test-file.txt
#+end_src

**** 用 grep -c 统计匹配的行数

#+begin_src shell
grep -c "go" demo_text
grep -v -c this demo_file
#+end_src

**** 用 grep -l 只显示文件名

#+begin_src shell
grep -l this demo_*
#+end_src

**** 只显示匹配的字串

#+begin_src shell
grep -o "is.*line" demo_file
#+end_src

**** 显示匹配的位置

#+begin_src shell
grep -o -b "3" temp-file.txt
#+end_src

**** 用 grep -n 在输出时显示行号

#+begin_src shell
grep -n "go" demo_text
#+end_src

*** sed
*** awk
